# Start!!!
# Instructions for use Python
# print("Hello world")

# СПЕЦСИВОЛЫ
# sep= - разделяет каждый элемент, если оставить пустым то в console выведите все элементы слитно
# end= -указывает, что конткретно будет находится в конце строки
# \" - указывает на то, что данная ковычка(") не является закрывающей, а просто обычный символ
# \n - команда которая позволяет перевести на новую строку
# \t - символ который создаёт табуляцию
# print("Result: ", 7, 15, "string", sep=",", end="!\n")
# print("Second \" l\ni\nn\ne")

# МАТКМАТИЧЕСКИЕ ДЕЙСТВИЯ
# print(5 + 5)
# print("Result:", 5 * 5)
# print("Result:", 5 ** 3) # возвидение в степень
# print("Result:", 5 // 3) # округление к целому (меньшему) числу

# МАТЕМАТИЧЕСКИЕ ФУНКЦИИ
# print("Result:", min(5,6,3,0,2,-3,5)) # находит минимальный элемент
# print("Result:", max(5,6,3,0,2,-3,5)) # находит максимальный элемент
# print('Result:', abs(-5)) # переводит число в положительное значение
# print('Result:', pow(5, 3)) # функция которая число возводит в степень
# print('Result:', round(5 / 3)) # округление к целому (ближайшему: или к большему; или к меньшему) числу

# ПОЛУЧЕНИЕ ДАННЫХ
# input() # команда запрашивающаяя значения от пользователя
# age = "You's year old: "
# name = "Your name: "
# age_1 = input("Ввидите свой возраст: ")
# name_1 = input("Ввидите своё имя: ")
# print(age + age_1)
# print(name + name_1)





